In [1]:
import pandas as pd
from IPython.display import display

data = {
    "Tid" : [1,2,3,4,5,6,7,8,9,10],
    "Refund" : ['Yes','No','No','Yes','No','No','Yes','No','No','No'],
    "Marital Status" : ["Single",'Married','Single','Married','Divorced','Married','Divorced','Single','Married','Single'],
    "Taxable Income" : ['125K','100K','70K','120K','95K','60K','220K','85K','75K','90K'],
    "Cheat" : ['No','No','No','No','Yes','No','No','Yes','No','Yes']
}

df = pd.DataFrame(data)

display(df)

display(df.iloc[[0, 4, 7, 8]])


print(df.iloc[3:7])
print(df.iloc[4:8, 2:4])

   Tid Refund Marital Status Taxable Income Cheat
0    1    Yes         Single           125K    No
1    2     No        Married           100K    No
2    3     No         Single            70K    No
3    4    Yes        Married           120K    No
4    5     No       Divorced            95K   Yes
5    6     No        Married            60K    No
6    7    Yes       Divorced           220K    No
7    8     No         Single            85K   Yes
8    9     No        Married            75K    No
9   10     No         Single            90K   Yes

   Tid Refund Marital Status Taxable Income Cheat
0    1    Yes         Single           125K    No
4    5     No       Divorced            95K   Yes
7    8     No         Single            85K   Yes
8    9     No        Married            75K    No

   Tid Refund Marital Status Taxable Income Cheat
3    4    Yes        Married           120K    No
4    5     No       Divorced            95K   Yes
5    6     No        Married            60K    No
6    7    Yes       Divorced           220K    No
  Marital Status Taxable Income
4       Divorced            95K
5        Married            60K
6       Divorced           220K
7         Single            85K